; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-2)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	infrared1 - mode
	image2 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
)
(:goal (and
	(have_image Planet3 infrared0)
	(have_image Planet4 infrared0)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 infrared0)
	(have_image Star7 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet3)
   goals met: 0 of 5
5. (take_image satellite0 planet3 instrument1 infrared0)
   added: (have_image planet3 infrared0)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon5 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon5 instrument1 image2)
   added: (have_image phenomenon5 image2)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon6 instrument1 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 3 of 5
10. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 3 of 5
11. (take_image satellite0 star7 instrument1 infrared0)
   added: (have_image star7 infrared0)
   goals met: 4 of 5
12. (turn_to satellite0 planet4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet4)
   goals met: 4 of 5
13. (take_image satellite0 planet4 instrument1 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 5 of 5
